app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaaaaa"], ["body", "aaaaaa"], ["created_at", "2019-11-20 07:35:09.187278"], ["updated_at", "2019-11-20 07:35:09.187278"]]
SELECT "books".* FROM "books"
---
 def create
        # ストロングパラメーターを使用
         @book = Book.new(list_params)
        # DBへ保存する
         if @book.save
        # トップ画面へリダイレクト
        flash[:notice] = "successfully"
        redirect_to book_path(@book.id)
        else
        	@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", ""], ["body", ""], ["updated_at", "2019-11-20 07:35:21.336593"], ["id", 6]]
---
    def update
        @book = Book.find(params[:id])
      if @book.update(list_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
    def destroy
    	 book = Book.find(params[:id]) #データ(レコード)を1件取得
        book.destroy #データ（レコード）を削除